#+TITLE: 3Sum
#+DATE: <2026-06-08>
#+FILETAGS: :leetcode:two_pointers:arrays:
#+PROPERTY: header-args :results output :session *shared*

** Solution

#+begin_src python

def threesum(nums):
    nums.sort()
    i = 0
    triplets = []
    while i < len(nums) - 2:
        if nums[i] > 0:
            break
        left, right = i+1, len(nums) - 1
        while left < right:
            s = nums[i] + nums[left] + nums[right]
            if s == 0:
                triplets.append([nums[i], nums[left], nums[right]])
                left = incr(nums, left, right)
                right = decr(nums, right, left)
            elif s > 0:
                right = decr(nums, right, left)
            else:
                left = incr(nums, left, right)
        i = incr(nums, i, len(nums) - 2)
    return triplets

def incr(nums, pointer, limit):
    while pointer < limit:
        pointer += 1
        if nums[pointer] != nums[pointer - 1]:
            break
    return pointer

def decr(nums, pointer, limit):
    while pointer > limit:
        pointer -= 1
        if nums[pointer] != nums[pointer + 1]:
            break
    return pointer

nums = [-1,0,1,2,-1,-4]                                
print(threesum(nums))    
# Output: [[-1,-1,2],[-1,0,1]]

nums = [0,1,1]
print(threesum(nums))
# Output: []

nums = [0,0,0]
print(threesum(nums))
# Output: [[0,0,0]]


#+end_src

#+RESULTS:
: [[-1, -1, 2], [-1, 0, 1]]
: []
: [[0, 0, 0]]


_Me_:

How does this solution look? Are there any possible edge case bugs

_AI_:

The solution looks solid and handles the examples correctly. A few
edge/readability notes:

1. *Duplicate skip helpers*: =incr= and =decr= might infinite-loop if
   =pointer == limit= initially — but your loop condition =left <
   right= and =i < len(nums) - 2= guards against that. Still, adding a
   safety check (e.g., =if pointer >= limit: return limit=) is
   defensive.

2. *Alternative simplification*: Instead of custom helpers, you could
   use =while left + 1 < right and nums[left] == nums[left+1]: left +=
   1= then =left += 1= (and symmetric for right). Slightly more
   standard.

3. *Two-pointer boundary after recording a triplet*: After appending,
   you increment left and decrement right — but what if after skipping
   duplicates, left >= right? The outer while condition catches that
   next iteration.

4. *Empty input / len < 3*: Your code assumes len >= 3. For
   robustness, you could add =if len(nums) < 3: return []= at the
   start.

Overall, correct and clean. Want to think about testing with cases
like =[-2,0,0,2,2]= or all negative numbers?

_Me_: Give me a version illustrating the second point above

_AI_:

#+begin_reasoning
The user wants a version of the solution that uses a more standard duplicate-skip approach instead of the custom incr/decr helpers. I'll provide a concise code snippet showing the inner loop with inline while loops to skip duplicates.
#+end_reasoning

Here's a version using inline while loops to skip duplicates after recording a triplet:

#+begin_src python
def threesum(nums):
    nums.sort()
    n = len(nums)
    triplets = []
    i = 0
    while i < n - 2:
        if nums[i] > 0:
            break
        left, right = i + 1, n - 1
        while left < right:
            total = nums[i] + nums[left] + nums[right]
            if total == 0:
                triplets.append([nums[i], nums[left], nums[right]])
                left += 1
                right -= 1
                # Skip duplicates for left
                while left < right and nums[left] == nums[left - 1]:
                    left += 1
                # Skip duplicates for right
                while left < right and nums[right] == nums[right + 1]:
                    right -= 1
            elif total < 0:
                left += 1
            else:
                right -= 1
        i += 1
        # Skip duplicates for i
        while i < n - 2 and nums[i] == nums[i - 1]:
            i += 1
    return triplets

nums = [-1,0,1,2,-1,-4]                                
print(threesum(nums))    
#+end_src

#+RESULTS:
: [[-1, -1, 2], [-1, 0, 1]]

This avoids separate helper functions and keeps duplicate-handling
inline, which many find more readable. Test with the same examples to
confirm.

_Me_:

I see, so we really do not need to skip duplicates when advancing only
the left or right pointers to guarantee unique triplets, and this
avoids the overhead of calling a function.

